{
  "slug": "site-perso",
  "title": "J'ai créé un site personnel",
  "date": "07/11/2025",
  "author": "Kylian JULIA",
  "tags": [
    "Angular"
  ],
  "excerpt": "<p>J&#39;avais besoin d&#39;un endroit qui m&#39;appartient à 100% pour regrouper et montrer tout ce que je fais et ce que je sais faire...</p>\n",
  "thumbnail": "/miniatures/project-default.png",
  "file": "site-perso",
  "content": "<p><strong>Lien GitHub :</strong> <a href=\"https://github.com/kylianjoff/kylianjulia\">https://github.com/kylianjoff/kylianjulia</a></p>\n<p>J&#39;ai déjà développé quelques projets WEB, je ne cesse de m&#39;améliorer dans ce domaine et j&#39;apprécie beaucoup ce que je fais. Mais j&#39;ai surtout réfléchi à faire un truc utile pour moi et c&#39;est à ce moment que j&#39;ai eu l&#39;idée de faire mon propre site perso. Mais pour qui ? Pour mettre quoi ? Pourquoi ? Comment ?</p>\n<h2>Pourquoi avoir fait ça ?</h2>\n<p>J&#39;ai tellement de chose à montrer qu&#39;il faut bien un endroit qui recense tout ce que je fais. Tout d&#39;abord j&#39;avais envie de partager mes aventures, plus précisément mes futurs stages ou mobilités internationales. Mais pas sur les réseaux, je voulais un endroit clean qui recense tout ce que je fais. Il fallait aussi que je montre ceux que je savais faire, mes compétences, mes expériences, mes formations, mes engagements ... mais il y a trop de chose que je ne peux pas tout mettre sur mon CV. J&#39;ai donc carrément une grande page dédié à moi, mes expériences, mes compétences, ce que je fait, et bien plus.</p>\n<h2>Comment j&#39;ai fait ce site ?</h2>\n<p>J&#39;ai développé uniquement un frontend pour ce site web, réalisé avec le Framework <strong>Angular</strong>, qui est un framework en TypeScript, un genre de JavaScript mais pour faire des applications web un minimum sécurisé, que j&#39;avais déjà utilisé pour un précédent projet.</p>\n<h4>Le design</h4>\n<p>J&#39;ai décidé d&#39;adopter un design aux couleurs simples et j&#39;ai essayé de faire de belles animations, sachant que le design est la partie où je suis le moins fort. A l&#39;heure actuelle, le design n&#39;est pas optimisé mais dans le futur je vais m&#39;en occuper, car pour le moment ça me prend inutilement de la bande passante et de la mémoire ce qui fait ralentir le chargement du site (pas très bon).</p>\n<h4>Gestion du système de post sans backend</h4>\n<p>Tous mes posts sont rédigés en Markdown et importé dans mon dossier source en Markdown. J&#39;ai un script d&#39;intégration continue qui, dès qu&#39;il y a une modification dans le dossier contenant mes posts sur la branche principale (main) de mon répertoire GitHub, celui ci rebuild le projet angular et qui le redéploie ce qui permet à un script JavaScript de chercher tous les fichiers en .md (Markdown) pour les convertir en html stocké dans des fichiers Json pour en même temps récupérer des données YAML concernant le titre, l&#39;auteur, la date et les mots-clés de chaque post. Cette méthode permet de bien différencier les en-têtes et les contenus pour améliorer l&#39;affichage sur l&#39;interface web.</p>\n"
}