{
  "slug": "associatif",
  "title": "Des gros changements après un an dans l'associatif",
  "date": "26/02/2026",
  "author": "Kylian JULIA",
  "tags": [
    "Associatif",
    "Clubs",
    "DreZZing",
    "Im@ge",
    "SIGMIX",
    "Shared",
    "IsiMalt"
  ],
  "excerpt": "<p>La période des passations vient de passer et il y a eu énormément de changement.</p>\n",
  "thumbnail": "/assets/blogs/associatif/logo.png",
  "file": "associatif",
  "content": "<h1>Un an dans l&#39;associatif ...</h1>\n<p>Il y a un an, au moment des passations, j&#39;ai pris la décision de m&#39;investir dans l&#39;associatif. De base je voulais faire parti du <strong>BDE</strong> (Bureau des étudiants) et de <strong>IsiGala</strong> (Association chargé de l&#39;organisation du gala annuel de l&#39;ISIMA). Mais mes plans se sont pas déroulé comme prévu : je n&#39;ai pas fait parti du <strong>BDE</strong> ni de <strong>IsiGala</strong> mais j&#39;ai quand même eu une bonne expérience associative au sein des autres associations et des clubs.</p>\n<h2>Ce qui s&#39;est passé en 1 an</h2>\n<p>L&#39;année a été chargé en travail associatif, en projets. Je vais passer en revu tous ce que j&#39;ai fait pendant cette année.</p>\n<h3>DreZZing</h3>\n<p><strong>DreZZing</strong> c&#39;est l&#39;association de textiles et de goodies de l&#39;ISIMA qui a été créé il y a deux ans, je fais donc parti du deuxième mandat de cette association. Le rôle de cette association est de s&#39;occuper principalement des polos des clubs et du BDE mais surtout des traditionnels vêtements de promos. Mais nous avons fait bien plus : des polos styles professionnels à l&#39;effigie de l&#39;ISIMA, des starter pack pour les nouveaux pour les inciter à côtiser et pour faire connaitre l&#39;association, s&#39;occuper de la vente des chopes <strong>IsiMalt</strong>...</p>\n<p><img src=\"/assets/blogs/associatif/slideDrezzing.png\" alt=\"Première slide de l'Assemblée Générale Ordinaire du 9 février\">\n<em>Assemblée Générale Ordinaire du 9 février 2026 pour la passation</em></p>\n<p>J&#39;ai fait parti de cette associaiton en tant que trésorier. En plus de gérer tout l&#39;aspect financier de l&#39;association, en tant que membre du bureau, il fallait gérer l&#39;équipe, s&#39;assurer que tout le monde fasse leur travail, gérer les projets en s&#39;assurant que tous les éléments soient présents et les deadlines respectées mais également de prendre les responsabilités des membres absents.</p>\n<p>Avec mon mandat nous avons fait énormément de chose : les chopes <strong>IsiMalt</strong>, les polos du <strong>BDE</strong> et des clubs, les polos ISIMA, les Starter Pack, les vêtements de promo 2025 mais surtout l&#39;amélioration du système de livraison du site avec la mise en place des livraison et la mise en place de pleins d&#39;outils internes comme un vault pour les identifiants de l&#39;association stocké sur notre propre serveur, un outil de monitoring eet bien plus.</p>\n<p><img src=\"/assets/blogs/associatif/financier.png\" alt=\"Bilan financier du mandat 2025/2026\">\n<em>Bilan financier du mandat 2025/2026</em></p>\n<p>J&#39;ai présenté mon bilan financier lors de l&#39;assemblée générale et j&#39;ai été fier d&#39;annoncer une hausse de 223% de la trésorerie sur mon mandat sans compté les 380€ promis par le FSDIE. L&#39;objectif financier de mon mandat était de ne pas finir dans le rouge et d&#39;essayer d&#39;augmenter les fonds pour faire des plus gros projets sans avoir besoin de demander un prêt au <strong>BDE</strong>. Objectifs réussis !</p>\n<h3>Im@ge</h3>\n<p><strong>Im@ge</strong> c&#39;est la junior entreprise de l&#39;ISIMA. Cette association été considérée comme morte depuis plusieurs années ... jusqu&#39;à sa renaissance en octobre 2025. J&#39;ai rejoint ce cours mandat qui n&#39;a duré que de octobre 2025 à février 2026 en tant que Vice-président afin de participer à une association qui est, pour moi, importante pour l&#39;école et les étudiants qui y participent.</p>\n<p>Ma mission principale était de m&#39;assurer des bons lien entre les projets confiés par les entreprises et les étudiants. Mais ce mandat avait surtout pour mission de mettre au clair els statuts, les missions et les objectifs de l&#39;association afin d&#39;assurer le meilleur redémarrage possible. Je n&#39;ai donc pas fait grand chose.</p>\n<p>J&#39;ai décidé de ne pas reconduire un second mandat dans cette association.</p>\n<h3>IsiMalt</h3>\n<p><strong>IsiMalt</strong>, le fameux club de bière de l&#39;ISIMA. En tant que grand amoureux de la bière je ne pouvais pas passer à côté de ce club. J&#39;ai donc rejoint ce club l&#39;année dernière en tant que responsable communication afin de relayer les événements du club et participer aux événements.</p>\n<p>Malheureusement j&#39;était dans un mandat pas très actif et je me suis retrouvé à faire un peu tout, ce qui m&#39;a épuisé.</p>\n<p><img src=\"/assets/blogs/associatif/afficheChope.png\" alt=\"Affiche vente de chope\">\n<em>Affiche de la vente des chopes de bière de IsiMalt</em></p>\n<p><img src=\"/assets/blogs/associatif/afficheCuvee.png\" alt=\"Affiche cuvée du WEB\">\n<em>Affiche pour annoncer la cuvée du WEB 2025</em></p>\n<p>Durant mon mandat je me suis principalement occupé de la vente des chopes à l&#39;effigie du club car le mandat précédent avait commandé des chopes à l&#39;effigie du club, il fallait que nous les vendons. Je me suis également intégralement occupé de la cuvée de bière que le club fait chaque année pour le week-end d&#39;intégration prévu le premier week-end d&#39;octobre. Il fallait commandé toutes les matières premières, retrouver le matériel du club, brasser, mettre en bouteille et les passer à l&#39;équipe du week-end d&#39;intégration. Pendant un mois j&#39;avais deux cuves de bière en fermentation sur mon bureau, au moins ça ne fane pas contrairement à mes plantes.</p>\n<p>En tant que responsable communication, j&#39;ai essayé de faire un nouveau genre de communication : des vidéos. J&#39;ai donc fait des vidéos principalement pour promouvoir les chopes de bière et pour présenter le club aux nouveaux étudiants à la rentrée. J&#39;ai également fait de la communication sur le compte instagram du club <strong>@isi_malt</strong>.</p>\n<h3>Shared</h3>\n<p>Jusqu&#39;à l&#39;année dernière il manquait un truc essentiel dans l&#39;associatif à l&#39;ISIMA : <strong>le caritatif</strong>.</p>\n<p>L&#39;année dernière, avec 5 autres personnes, nous avons fondé le club <strong>Shared</strong> qui a pour objectif de relayer des événements caritatifs d&#39;associations du bassin clermontois mais on avait également pour objectif d&#39;en créer et aussi de s&#39;occuper de la partie associatif du live caritatif <strong>ZZevent</strong> organisé chaque année par le BDE.</p>\n<p>Je suis donc membre fondateur du club Shared mais surtout le responsable de la communication interne (&quot;interne&quot; car il y a le rôle responsable communication externe qui s&#39;occupe des contacts avec les associations).</p>\n<p><img src=\"/assets/blogs/associatif/esope.png\" alt=\"Affiche esope\">\n<em>Affiche partenariat avec Esope 63</em></p>\n<p><img src=\"/assets/blogs/associatif/zzevent.png\" alt=\"Affiche ZZevent 2025\">\n<em>Affiche pour le ZZevent 2025</em></p>\n<p><img src=\"/assets/blogs/associatif/dons.png\" alt=\"Affiche résultat des dons\">\n<em>Somme record des dons lors d&#39;un ZZevent</em></p>\n<p><img src=\"/assets/blogs/associatif/kabubu.png\" alt=\"Affiche KABUBU\">\n<em>Affiche de la Fresque de l&#39;Immigration organisé avec KABUBU</em></p>\n<p>Mon mandat nous avons donc travaillé avec l&#39;épicerie solidaire <strong>ESOPE 63</strong> qui organisait une récolte de vaisselle nous avons donc fait de même mais malheureusement le temps de créer le club et de prendre contact avec eux, les étudiants qui devait partir de Clermont-Ferrand étaient déjà parti et ne pouvait plus donner leur vaisselle. Au final ça a été un flop.</p>\n<p>Nous avons ensuite était beaucoup en contact avec l&#39;association <strong>KABUBU</strong> qui devait être l&#39;association bénéficiaire du ZZevent 2025 mais après plusieurs mois de contact, le BDE décide 1 mois et demi avant l&#39;événement de changer d&#39;association et de partir sur <strong>Five O&#39;Kloeck</strong>. Afin de ne pas abandonner de manière malpoli <strong>KABUBU</strong>, nous avons organisé un atelier <strong>Fresque de l&#39;immigration</strong> qui est un atelier créé et géré par <strong>KABUBU</strong>. Malheureusement l&#39;association a décidé d&#39;annuler et de ne pas se déplacer car nous avons eu seulement deux personnes inscrites (c&#39;est compréhensible). Et enfin on s&#39;est occupé de la partie associative du ZZevent 2025 en entrant en contact avec l&#39;association <strong>Five O&#39;Kloeck</strong> et en gérant la régis du live caritatif.</p>\n<p>J&#39;ai également développé un gros projet pour <strong>Shared</strong> : le TooGoodToGo des étudiants dont j&#39;en ai déjà parlé sur <a href=\"https://kylianjulia.fr/project-post/toogoodtogo-des-etudiants\">mon blog</a>. Ce projet, qui n&#39;est toujours pas déployé, est devenu un projet personnel que j&#39;améliore sur mon temps libre et dont je me débrouillerai pour le déployer tout seul.</p>\n<p>Enfin, comme pour IsiMalt, j&#39;ai améliorer la façon de communiquer et les vidéos sont disponible sur le compte instagram de Shared : <strong>@shared_isima</strong>.</p>\n<p>Malheureusement cette année personne ne veut reprendre ce club, personne n&#39;a l&#39;air d&#39;être intéressé par le caritatif. Ce club est dont archivé en attendant que quelqu&#39;un ai envie de le reprendre.</p>\n<h3>SIGMIX</h3>\n<p><strong>SIGMIX</strong> est à l&#39;origine le club de mix de Sigma Clermont, mais ils ont décidé de devenir une association ouverte à l&#39;ISIMA. J&#39;ai donc rejoint cette association en mai 2025 pour apprendre à mixer. Je ne connaissais rien au mix j&#39;ai donc apris et commencé à mixer en soirée fin mai. Depuis je suis DJ dans cette association et j&#39;assure des soirées à l&#39;ISIMA et à Sigma Clermont (je peux m&#39;incruster dans des soirées qui ne sont pas dans mon école).</p>\n<p>SIGMIX intervient principalement dans des soirées à Sigma Clermont et à l&#39;ISIMA qui ont besoin de DJ. Grâce au statut d&#39;association de Clermont Auvergne INP et non de seulement une école, <strong>SIGMIX</strong> a pu bénéficier de beaucoup de subvention permettant l&#39;association de bien s&#39;équiper (platines de DJ, lumières et autres accessoires).</p>\n<p><img src=\"/assets/blogs/associatif/boiler.png\" alt=\"Affiche Boiler Room du 10 janvier\">\n<em>Affiche de la Boiler Room du 10 janvier</em></p>\n<p>Début janvier pour la première fois, <strong>SIGMIX</strong> a organisé sa propre soirée : une <strong>Boiler Room</strong>. Une <strong>Boiler Room</strong> est une soirée techno où les DJ sont au centre de la salle et les gens sont autour des DJ. Pour cette Boiler je n&#39;avais pas le temps de préparer quoi que ce soit, j&#39;aurai bien aimé mixer. C&#39;était un événement de Sigma Clermont et de l&#39;ISIMA, mais il y a eu tellement de personnes externes que suite à cette soirée de nombreux BDE ont demandé l&#39;organisation de nouvelles Boiler. Le nouveau mandat va tout faire pour en organiser un peu plus, dont certainement une fin mars (restez informé sur instagram : <strong>@sigmix_</strong>).</p>\n<h2>Ce qui change avec ces passations</h2>\n<h3>Pleins de démission</h3>\n<p>Cette année j&#39;ai décidé de réduire drastiquement réduire mon engagement dans l&#39;associatif, principalement car je pars de Clermont-Ferrand pour mon stage et que je vais très probablement faire ma dernière année d&#39;étude au Québec. C&#39;est très compliqué de faire pleins de choses à distance. De plus ça me permet de poursuivre mes projets persos.</p>\n<p>J&#39;ai donc décidé de ne reconduire aucun mandat et donc de démissionner sauf pour une association : <strong>SIGMIX</strong>.</p>\n<h3>Je bosse alors que je ne suis plus là</h3>\n<p>Il reste une association que je n&#39;ai pas quitté : <strong>SIGMIX</strong></p>\n<p>Je fais parti de <strong>SIGMIX</strong> depuis mai 2025 en tant que DJ. Aujourd&#39;hui et depuis ce mois de février, je suis responsable de la communication de cette association, mais je ne suis pas le seul : nous sommes trois dans cette équipe communication.</p>\n<p>Mon rôle va être principalement de relayer la communication auprès des étudiants de l&#39;ISIMA qui, jusqu&#39;ici est quasi inexistante. De plus, j&#39;ai pour objectif d&#39;améliorer la communication inter-école pour les grands événements de l&#39;association comme les Boiler Room.</p>\n<p>Ce rôle je peux le faire à distance, ce qui est pratique puisque je ne serai plus disponible en présentiel.</p>\n<p>Au final, je ne reste à ce jour engagé dans une seule association à un rôle que je peux assurer à distance.</p>\n"
}