{
  "slug": "toogoodtogo-des-etudiants",
  "title": "J'ai créé un TooGoodToGo entièrement gratuit pour les étudiants",
  "date": "08/11/2025",
  "author": "Kylian JULIA",
  "tags": [
    "Angular",
    "ASP.NET"
  ],
  "excerpt": "<p>Et si les étudiants pouvaient récupérer gratuitement les invendus du BDE ou du resto U ? C’est la question que je me suis posée avant de créer une plateforme inspirée de TooGoodToGo — mais 100 % gratuite pour les étudiants.</p>\n",
  "thumbnail": "/assets/blogs/toogoodtogo-des-etudiants/logo.png",
  "file": "toogoodtogo-des-etudiants",
  "content": "<p>Un TooGoodToGo pour les étudiants ? Mais pourquoi ?</p>\n<p>Il faut que je vous raconte toute l&#39;histoire qui m&#39;a mené à ce projet.</p>\n<p><img src=\"/assets/blogs/toogoodtogo-des-etudiants/accueil.png\" alt=\"Page d'accueil de la plateforme - capture d'écran\">\n<em>Capture d&#39;écran du haut de la page d&#39;accueil de la plateforme.</em></p>\n<h2>La connaissance d&#39;un problème</h2>\n<p>En mars 2025 et avec 5 autres personnes, nous avons fondé <strong>Shared</strong>, le club caritatif de l&#39;ISIMA. Dès les débuts du club, nous avons eu connaissance de quelques problèmes de gaspillage alimentaire. Etonnant ? Non, ces problèmes sont partout. Mais dès le début de notre mandat, nous avons eu des echos du BDE (Bureau Des Etudiants) expliquant qu&#39;ils avait un trop gros stock de crêpe industriel car les consommateurs habituels étaient partis en stage et ils avaient également un gros stock de jus de fruit presque périmé datant du week-end d&#39;intégration. Ils n&#39;arrivaient pas à les vendre et périmaient petit à petit. Il y a également des responsables du restaurant universitaire du campus qui nous ont faire par d&#39;un problème de gaspillage, ils avaient beaucoup de nourriture encore consommable mais qu&#39;ils étaient obligés de jeter car ils ne peuvent servir les plats qu&#39;un certain nombre de fois, alors qu&#39;ils sont encore bon.\nAprès avoir écouté tous ces problèmes, j&#39;ai pensé à un système, ou plutôt à une plateforme, pour permettre aux BDE et aux autres donateurs comme le restaurant universitaire de donner gratuitement les aliments encore consommable uniquement aux étudiants.</p>\n<h2>Une organisation au top</h2>\n<h3>Organisation des utilisateurs</h3>\n<p>L&#39;objectif était de faire un service exclusivement pour les étudiants et les BDE (Bureau Des Etudiants), il ne fallait donc pas que la plateforme soit entièrement ouverte à tous et contrôler les inscriptions.</p>\n<p><img src=\"/assets/blogs/toogoodtogo-des-etudiants/inscription.png\" alt=\"Moyens de s'inscrire — capture d'écran\">\n<em>Capture d&#39;écran des différentes options d&#39;inscription proposées aux utilisateurs (compte étudiant, compte donateur).</em> </p>\n<p>Pour contrôler que les personnes soient bien des étudiants, nous avons au départ pensé à utilisé le CAS (Centre d&#39;Authentification Sécurisé) de l&#39;UCA (Université Clermont Auvergne) sur lequel tous les étudiants de Clermont-Ferrand ont un compte. Ceci nous permettait d&#39;être sûr que chaque personne qui se connectait sur la plateforme étaient étudiant durant l&#39;année en cours. Mais l&#39;UCA a refusé que nous utilisons leur CAS. Il a donc fallu faire un système d&#39;authentification propre à notre plateforme.\nNous devons tout de même toujours contrôler que chaque personne inscrit soit étudiant.</p>\n<h3>Organisation des dons et des réservations</h3>\n<p>La partie intéressante pour les étudiants et de savoir comment obtenir les dons. Sur cette plateforme, le donateur a juste à mettre les informations sur le don (nom, description, date de péremption et quantité). Pour les BDE ils doivent également dire si il faut don uniquement aux étudiant de leur école ou à tous les étudiants inscrit sur la plateforme. Ensuite l&#39;étudiant qui voit le don il peut le réserver, mais pas pendant un temps infini, le don est réservé pendant 30 minutes. Pour éviter qu&#39;une personne un peu malin embête tout le monde, un étudiant ne peut réserver qu&#39;un don à la fois. Ensuite l&#39;étudiant à donc 30 minutes pour aller le retirer au lieu où se trouve le donateur.</p>\n<p><img src=\"/assets/blogs/toogoodtogo-des-etudiants/etapes.png\" alt=\"Les étapes - capture d'écran\">\n<em>Capture d&#39;éran des étapes de la mise en ligne d&#39;un don jusqu&#39;à la récupération du don par un étudiant.</em></p>\n<h2>Les technologies utilisées</h2>\n<p>AU moment de commencer ce projet ça faisait un moment que je n&#39;avais pas fait de page web. Toutes les pages web que j&#39;avais fait il y a une époque n&#39;étaient que personnelles et n&#39;ont jamais été publique. Les autres développeurs vont haluciner mais pour mon excuse je n&#39;avais pas beaucoup de connaissance que je faisais mes pages web en PHP... Certaines personnes le save : le PHP est une passoire en terme de sécurité mais par on ne sait quel miracle, ce langage de programmation est toujours en vie (Les cours de pentest et de sécurité web m&#39;ont bien montré toutes les failles que précente ce langage). C&#39;est à ce moment là que j&#39;ai appris les Framework TypeScript pour développer des applications web. Bon j&#39;arrête de trop raconter ma vie et je vais aller trois au but de cette section : j&#39;ai utilisé le framework <strong>Angular</strong> (framework de Google) pour le frontend et j&#39;ai utiliser le service <strong>ASP.NET</strong> (service WEB dotnet de Microsoft) pour le backend qui lui utilise du C#, un langage que je n&#39;avais jamais utilisé même si il est connu.</p>\n<h2>Où en est le projet aujourd&#39;hui ?</h2>\n<p>Depuis fin août 2025 nous avons une version prête mais le déployement n&#39;est toujours pas à l&#39;ordre du jour. Donc vous vous demandez sûrement pourquoi j&#39;ai fait tout ça ? Parce que ce projet aurait dû voir le jour à la rentrée de septembre 2025 et de notre côté on avait un moyen de déployer tout prêt.\nShared a les financements nécessaire pour payer le serveur sur lequel sera hébergé la plateforme et pour payer le nom de domaine mais le club n&#39;a pas de carte bleu (mais le club a un compte BDE sur lequel est stocké l&#39;argent). Notre idée était de passer par le compte OVH (hébergeur) du BDE de l&#39;ISIMA (qui eux ont une carte bleu déjà enregistré et qui finance le projet) et on aurait juste a déduire le montant de la plateforme du compte BDE du club. Mais depuis fin août le BDE ne donne pas de réponse à notre requête suite à plusieurs relance (il faut juste dire oui ou non).</p>\n<h2>Ce que j&#39;ai appris de ce projet</h2>\n<p>Ce projet a été le plus gros que j&#39;ai réalisé à ce jour. Même si je l&#39;ai développé seul, je remercie toutes les personnes qui m&#39;ont soutenu et conseillé, plus particulièrement au mandat 2025 du club Shared qui m&#39;ont tous soutenu dès que je leur ai soumis l&#39;idée de cette plateforme. Ce projet m&#39;a appris d&#39;un côté technique le langage C# mais également à utilisé différentes techniques pour différentes parties de la plateforme et également l&#39;API qui relie le frontend et le backend.\nJ&#39;espère très fortement que je vais pouvoir déployer cette plateforme un jour ne serait-ce pour ne pas avoir gaspillé du temps mais surtout pour apporter une solution gratuite pour tous les donateurs et étudiants permettant de limiter le gaspillage alimentaire en aidant les étudiants.\nSi le BDE de l&#39;ISIMA continu a ne rien faire pour ce projet, je chercherai un autre moyen et un autre financement pour le déployer. J&#39;ai également énormément de piste d&#39;amélioration pour cette plateforme mais je m&#39;y concentrerai uniquement quand je serai sûr que cette plateforme verra le jour.</p>\n"
}